{
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            145,
            145,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "conv2d_input"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 16,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            145,
            145,
            3
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            143,
            143,
            16
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 32,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            71,
            71,
            16
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            67,
            67,
            32
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 64,
          "kernel_size": [
            10,
            10
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            33,
            33,
            32
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            24,
            24,
            64
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "filters": 128,
          "kernel_size": [
            12,
            12
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            12,
            12,
            64
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1,
            1,
            128
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Flatten",
        "config": {
          "name": "flatten",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "data_format": "channels_last"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1,
            1,
            128
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            128
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "rate": 0.25,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            128
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        }
      }
    ],
    "build_input_shape": [
      null,
      145,
      145,
      3
    ]
  },
  "registered_name": null,
  "build_config": {
    "input_shape": [
      null,
      145,
      145,
      3
    ]
  },
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "Adam",
      "config": {
        "name": "Adam",
        "learning_rate": 0.0010000000474974513,
        "weight_decay": null,
        "clipnorm": null,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "beta_1": 0.8999999761581421,
        "beta_2": 0.9990000128746033,
        "epsilon": 1e-07,
        "amsgrad": false
      },
      "registered_name": null
    },
    "loss": {
      "module": "builtins",
      "class_name": "function",
      "config": "binary_crossentropy",
      "registered_name": "function"
    },
    "loss_weights": null,
    "metrics": [
      [
        {
          "module": "keras.metrics",
          "class_name": "MeanMetricWrapper",
          "config": {
            "name": "accuracy",
            "dtype": "float32",
            "fn": "binary_accuracy"
          },
          "registered_name": null
        }
      ]
    ],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": false
  }
}